; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-5)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city6)
	(= (capacity plane1) 2675)
	(= (fuel plane1) 832)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city6)
	(= (capacity plane2) 8446)
	(= (fuel plane2) 448)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 8)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city2)
	(= (capacity plane3) 11309)
	(= (fuel plane3) 2652)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 14)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 10)
	(at person1 city4)
	(at person2 city1)
	(at person3 city5)
	(at person4 city4)
	(at person5 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 538)
	(= (distance city0 city2) 643)
	(= (distance city0 city3) 892)
	(= (distance city0 city4) 813)
	(= (distance city0 city5) 948)
	(= (distance city0 city6) 740)
	(= (distance city1 city0) 538)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 636)
	(= (distance city1 city3) 844)
	(= (distance city1 city4) 997)
	(= (distance city1 city5) 744)
	(= (distance city1 city6) 848)
	(= (distance city2 city0) 643)
	(= (distance city2 city1) 636)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 967)
	(= (distance city2 city4) 932)
	(= (distance city2 city5) 973)
	(= (distance city2 city6) 907)
	(= (distance city3 city0) 892)
	(= (distance city3 city1) 844)
	(= (distance city3 city2) 967)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 674)
	(= (distance city3 city5) 719)
	(= (distance city3 city6) 651)
	(= (distance city4 city0) 813)
	(= (distance city4 city1) 997)
	(= (distance city4 city2) 932)
	(= (distance city4 city3) 674)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 665)
	(= (distance city4 city6) 954)
	(= (distance city5 city0) 948)
	(= (distance city5 city1) 744)
	(= (distance city5 city2) 973)
	(= (distance city5 city3) 719)
	(= (distance city5 city4) 665)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 759)
	(= (distance city6 city0) 740)
	(= (distance city6 city1) 848)
	(= (distance city6 city2) 907)
	(= (distance city6 city3) 651)
	(= (distance city6 city4) 954)
	(= (distance city6 city5) 759)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane3 city0)
	(at person1 city3)
	(at person2 city3)
	(at person3 city2)
	(at person4 city6)
	(at person5 city0)
	))

(:metric minimize (+ (* 2 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane3 city2)
   changed: (fuel plane3) from 2652 to 11309
   goals met: 0 of 6
2. (fly plane1 city6 city0)
   deleted: (at plane1 city6)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 740, (fuel plane1) from 832 to 92
   goals met: 0 of 6
3. (fly plane3 city2 city5)
   deleted: (at plane3 city2)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 740 to 5605, (fuel plane3) from 11309 to 6444
   goals met: 0 of 6
4. (board person3 plane3 city5)
   deleted: (at person3 city5)
   added: (in person3 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 6
5. (fly plane3 city5 city1)
   deleted: (at plane3 city5)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 5605 to 9325, (fuel plane3) from 6444 to 2724
   goals met: 0 of 6
6. (board person2 plane3 city1)
   deleted: (at person2 city1)
   added: (in person2 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 0 of 6
7. (refuel plane3 city1)
   changed: (fuel plane3) from 2724 to 11309
   goals met: 0 of 6
8. (fly plane3 city1 city3)
   deleted: (at plane3 city1)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 9325 to 13545, (fuel plane3) from 11309 to 7089
   goals met: 0 of 6
9. (debark person2 plane3 city3)
   deleted: (in person2 plane3)
   added: (at person2 city3)
   changed: (onboard plane3) from 2 to 1
   goals met: 1 of 6
10. (fly plane3 city3 city4)
   deleted: (at plane3 city3)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 13545 to 16915, (fuel plane3) from 7089 to 3719
   goals met: 1 of 6
11. (refuel plane3 city4)
   changed: (fuel plane3) from 3719 to 11309
   goals met: 1 of 6
12. (board person1 plane3 city4)
   deleted: (at person1 city4)
   added: (in person1 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 1 of 6
13. (board person4 plane3 city4)
   deleted: (at person4 city4)
   added: (in person4 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 1 of 6
14. (fly plane3 city4 city3)
   deleted: (at plane3 city4)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 16915 to 20285, (fuel plane3) from 11309 to 7939
   goals met: 1 of 6
15. (debark person1 plane3 city3)
   deleted: (in person1 plane3)
   added: (at person1 city3)
   changed: (onboard plane3) from 3 to 2
   goals met: 2 of 6
16. (board person5 plane3 city3)
   deleted: (at person5 city3)
   added: (in person5 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 2 of 6
17. (fly plane3 city3 city6)
   deleted: (at plane3 city3)
   added: (at plane3 city6)
   changed: (total-fuel-used) from 20285 to 23540, (fuel plane3) from 7939 to 4684
   goals met: 2 of 6
18. (debark person4 plane3 city6)
   deleted: (in person4 plane3)
   added: (at person4 city6)
   changed: (onboard plane3) from 3 to 2
   goals met: 3 of 6
19. (fly plane3 city6 city0)
   deleted: (at plane3 city6)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 23540 to 27240, (fuel plane3) from 4684 to 984
   goals met: 4 of 6
20. (refuel plane3 city0)
   changed: (fuel plane3) from 984 to 11309
   goals met: 4 of 6
21. (debark person5 plane3 city0)
   deleted: (in person5 plane3)
   added: (at person5 city0)
   changed: (onboard plane3) from 2 to 1
   goals met: 5 of 6
22. (fly plane3 city0 city2)
   deleted: (at plane3 city0)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 27240 to 30455, (fuel plane3) from 11309 to 8094
   goals met: 4 of 6
23. (debark person3 plane3 city2)
   deleted: (in person3 plane3)
   added: (at person3 city2)
   changed: (onboard plane3) from 1 to 0
   goals met: 5 of 6
24. (fly plane3 city2 city0)
   deleted: (at plane3 city2)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 30455 to 33670, (fuel plane3) from 8094 to 4879
   goals met: 6 of 6
